wolfSSL/wolftpm-examples/Infineon/PSoC6_WiFi_HTTPS_Server/source/secure_http_server.c
/* Company Logo */
#define INFINEON_LOGO \
    "<img style=\"float: right;\" alt=\"logo.png\" "\
    "src=\"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAATkAAABcBAMAAADngd+fAA" \
           "AAD1BMVEX///8VWJbiOlVtkLHIxNm177myAAAEAklEQVR4AezBgQAAAACAoP2pF6kCA" \
           "ABmxgxw29VhMO4WHwArHABlOQBpOIAJvv+ZnmPolnbbwn9Dev2EPNJK3m+fHZPRlmRf" \
           "JMKvh7aRwSvKXAsMryg0NnhFdcmKyvCSIupf1DgVErnzjJMkp8KJ0p2WLJJqhtPkR6L" \
           "hPfvfPOxIdSZe9iHS9JGdV/5Lj+xiOEVX7z2851qIkHr4rRbadFqrKNz4sYpOkAY4qD" \
           "XNX1unmk6zDtM7nZLR9Fu6hehU89CGcEc1HcJhurdHOqrFp1gXoKL7sqp80LuObPNHR" \
           "0V9NQHQgsZ6MohmbnYdG10XOxr0xiVIvV6JGGAx2LKjMUp0LbqF9nXcS4tEk+aO/aI3" \
           "EPdA5dcwLORwbhYWNjpSleiAesvRW5OzfQP4ZaOvt4f0kRKY5iIquEpAQJPeKKSuNjr" \
           "LrmGeWoUdKzrWON/pBriQUF8cUS6rVcM7EqlWUrp4VZSZeHErcVkxDSJIcxw6DY3RlS" \
           "u6qSPWfGB0rlyLK2vSq99iw7tHYdn9SJqIYOn1Pk5ArAGQ4OI6/XRoth3c6RgrumFHW" \
           "4Z9qfa1vENhqNT1G91C7hMdd4Xucozu8kHXP9E5pOkrOkxpnW+3Oa1p5R2HXA27FiIQ" \
           "TT5A3Ohwo7PJgJbuD96RaqNzn+lu6e2W0k1/vFUDZVLsaaMnoysf9+pdAbMudPr9Qlz" \
           "2EP8zXX+ULhU85dPr3TvTYMs4CG90qLHes7rEYl6n4U/eORH5wbtk3qW3is7U0YQidz" \
           "ogLnRDAes1p5tA1xYODONvvTNU+IYOtO20qKkInuimZLbvfWd0pSPjFDWzAVsu1NCiG" \
           "3/cs6qDe7aic3C50yFtdD0UusXy2EQZOge6bM278L13eiHf593UnHdIpr2IVDx/ors4" \
           "8647Nu/s/PS9dxcb55FWmo54B7RrMhct21LT9epX9ayQOLQPUOO3dLg/z4jgEF2kTfv" \
           "N9pyt6dC+stCDudtsvHCn657oLDvrmmZoVbY+fA5I1RmlriwSG123obsjR2OGbyWsAe" \
           "Xw+c7ES32++1JoyaEpr4J/kDTPxhOg6az/K0Y4rEczuvRIt9JjtbIwewx5CygIeQyIE" \
           "vLoOaCwHDHvMB6OT5V9Si8fAlXAEHzmMAbPOWD2cMV8zXqFEHL2oxwxz/NBuAA/a42b" \
           "Ukyg8tkrXQjjqDBidNd89Uo3+qx0DE3lw3jY7FBMd7GlDlLolEV8HtU29c5flVKCmoq" \
           "Z4Tw8+1sP4vHZ72SbxhlcG68UVgBOxWvZlw8PHhGBc3X1JvneNx/+75faX79zx/wC75" \
           "SNwRSC4MYlcv/I1i/C96QALyH8ClDgdYTy4Jr81x4cEwAAACAMsn9qM+wHlgEAAADAA" \
           "To83zvHyP+JAAAAAElFTkSuQmCC\" />"

#define HTTPS_STARTUP_HEADER \
"<!DOCTYPE html>" \
"<html>" \
"<head>" \
"<title>Infineon TPM Firmware Update Demo</title>" \
"</head>" \
"<body>" \
"<h1 style=\"text-align: left\">Infineon TPM Firmware Update Demo" \
INFINEON_LOGO \
"</h1>" \
"<p><span style=\"font-size: 12pt;\"><strong>Infineon</strong> is the first TPM vendor to <strong>open source their " \
"firmware update procedure and process</strong> in their latest <strong>Infineon SLB9672 (SPI) and SLB9673 (I2C)</strong> versions of the TPM 2.0 module.</span></p>" \
"<p><span style=\"font-size: 12pt;\"><strong>wolfTPM</strong> is the only library to offer integrated support for updating TPM firmware.</span></p>" \
"<p><span style=\"text-decoration: underline;\"><span style=\"font-size: 12pt;\">Demo Platform:</span></span></p>" \
"<ul>" \
"    <li><span style=\"font-size: 12pt;\">Infineon PSoC 62S2 evaluation kit (Wifi)</span></li>" \
"    <li><span style=\"font-size: 12pt;\">Infineon SLB9373 (I2C) TPM 2.0 mikroBUS module</span></li>" \
"    <li><span style=\"font-size: 12pt;\">Modus Toolbox Wi-Fi-HTTPS-Server demo</span>" \
"    <ul>" \
"        <li><span style=\"font-size: 12pt;\">wolfSSL TLS v1.3 server</span></li>" \
"        <li><span style=\"font-size: 12pt;\">wolfTPM</span></li>" \
"    </ul>" \
"    </li>" \
"</ul>" \
"<h2>TPM Module Interface</h2>" \
"<form method=\"get\">" \
"<fieldset>" \
"    <legend>Firmware Status</legend>" \
"    <input type=\"submit\" value=\"Refresh TPM\"/>" \
"    <textarea id=\"tpm_status\" name=\"tpm_status\" rows=\"4\" cols=\"60\">"

#define HTTPS_STARTUP_FOOTER \
"    </textarea>" \
"</fieldset>" \
"</form>" \
"<form method=\"post\">" \
"<fieldset>" \
"    <legend>Firmware Update</legend>" \
"    <p>" \
"        <label for=\"manifest\">Manifest File:</label>" \
"        <input type=\"file\" name=\"manifest\" value=\"Manifest File\"/></br></br>" \
"    </p>" \
"    <p>" \
"        <label for=\"data\">Firmware File:</label>" \
"        <input type=\"file\" name=\"data\" value=\"Firmware File\"/>" \
"    </p>" \
"    <input type=\"submit\" name=\"submit\" value=\"Update Firmware\"/>" \
"</fieldset>" \
"</form>" \
"</body>" \
"</html>"





/*******************************************************************************
 * Function Name: dynamic_resource_handler
 *******************************************************************************
 * Summary:
 *  Handles HTTPS GET, POST, and PUT requests from the client.
 *  HTTPS GET sends the current CYBSP_USER_LED status as a response to the client.
 *  HTTPS POST toggles the CYBSP_USER_LED and then sends its current state as a
 *  response to the client.
 *  HTTPS PUT sends an error message as a response to the client if the resource
 *  registration is unsuccessful.
 *
 * Parameters:
 *  url_path - Pointer to the HTTPS URL path.
 *  url_parameters - Pointer to the HTTPS URL query string.
 *  stream - Pointer to the HTTPS response stream.
 *  arg - Pointer to the argument passed during HTTPS resource registration.
 *  https_message_body - Pointer to the HTTPS data from the client.
 *
 * Return:
 *  int32_t - Returns HTTPS_REQUEST_HANDLE_SUCCESS if the request from the client
 *  was handled successfully. Otherwise, it returns HTTPS_REQUEST_HANDLE_ERROR.
 *
 *******************************************************************************/
int32_t dynamic_resource_handler(const char* url_path,
                                 const char* url_parameters,
                                 cy_http_response_stream_t* stream,
                                 void* arg,
                                 cy_http_message_body_t* https_message_body)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    int32_t status = HTTPS_REQUEST_HANDLE_SUCCESS;
    char https_response[MAX_HTTP_RESPONSE_LENGTH] = {0};
    char *register_new_resource = NULL;
    const char* msg;

    switch (https_message_body->request_type)
    {
        case CY_HTTP_REQUEST_GET:
            APP_INFO(("Received HTTPS GET request.\n"));

            /* Send the HTTPS response. */
            msg = HTTPS_STARTUP_HEADER;
            result = cy_http_server_response_stream_write_payload(stream,
                msg, strlen(msg));
            if (CY_RSLT_SUCCESS == result) {
                msg = TPM2_IFX_GetInfo();
                result = cy_http_server_response_stream_write_payload(stream,
                    msg, strlen(msg));
            }
            if (CY_RSLT_SUCCESS == result) {
                msg = HTTPS_STARTUP_FOOTER;
                result = cy_http_server_response_stream_write_payload(stream,
                    msg, strlen(msg));
            }
            if (CY_RSLT_SUCCESS != result) {
                ERR_INFO(("Failed to send the HTTPS GET response.\n"));
            }
            break;

        case CY_HTTP_REQUEST_POST:
            APP_INFO(("Received HTTPS POST request.\n"));

            /* TODO: Upload the files using the */
            #if 0
            rc = wolfTPM2_FirmwareUpgrade(&mDev,
                fwinfo.manifest_buf, (uint32_t)fwinfo.manifest_bufSz,
                TPM2_IFX_FwData_Cb, &mFwInfo);
            #endif
            (void)mFwInfo;

